app/views/restaurants/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "restaurant_categories" ON "categories"."id" = "restaurant_categories"."category_id" WHERE "restaurant_categories"."restaurant_id" = ?  [["restaurant_id", 5]]
---
  <ul>
    <% @restaurant.categories.each do |category| %>