app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save
---
INSERT INTO "restaurants" ("name", "street", "city", "state", "country", "postal_code", "neighborhood_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update

    if @restaurant.update(restaurant_params)
---
UPDATE "restaurants" SET "street" = ?, "state" = ?, "postal_code" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["street", "12 Street2"], ["state", "ST2"], ["postal_code", "11112"], ["updated_at", "2016-05-21 22:04:30.807749"], ["id", 2]]

  def destroy
    @restaurant.delete
---
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 20]]

  def find_restaurant
    @restaurant = Restaurant.find_by_id(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", 20]]